server/app/controllers/stories_controller.rb

SELECT "stories".* FROM "stories"
---
  def index
  	params.permit(:callback)
  	if params[:callback]
  		respond_to do |format|
  			#format.html { render json: {stories: Story.all}}
	  		format.js { render json: {stories: Story.all}, :callback => params[:callback] }

INSERT INTO "stories" ("created_at", "text", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-09-25 21:22:31.280471"], ["text", "<h4>This is the body of text</h3>"], ["title", "This is a title"], ["updated_at", "2014-09-25 21:22:31.280471"]]
---
  def create
  	params.permit(:title, :text)
  	Story.create(title:params[:title], text: params[:text])